Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་ན་ཡང་སྙིང་པོ་མེད་པ་ནི་རྙེད་སླའོ། །སྙིང་པོ་ཅན་ནི་རྙེད་པར་དཀའོ་ཞེས་ཐ་སྙད་དུ་བྱེད་དོ།
en: It makes the conventional statement that even ordinarily it is easy to get something worthless, but it is hard to get something worth a lot. “

source: །གང་དག་ཆོས་འདི་དག་མཉམ་པ་ཉིད་དུ་མངོན་སུམ་དུ་མི་བྱེད་པ་ཞེས་བྱ་བ་ནི་རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་སྐུ་དང་ཡང་དག་པའི་མཐའ་ཡང་མཉམ་པ་ཉིད་དོ།
en: It is right to bow down to those bodhisattva great beings… who do not actualize these dharmas as being the same”— to stream enterers and so on and tathāgatas as being the same, and to the dharma body and the very limit of reality as being the same. “

source: །ནམ་མཁའ་དབེན་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་དབེན་པའི་རྣམ་པས་སོ།
en: Because space is isolated”— because space is isolated from its mental image.

source: །འདི་ཡང་འགྲེས་གསུམ་སྟེ། ནམ་མཁའ་དང་སེམས་ཅན་མཐུན་པའི་འགྲེས་དང་། ནམ་མཁའ་ལྟ་བུའི་སེམས་ཅན་གྱི་གོ་ཆའི་འགྲེས་དང་། གཟུགས་ལ་སོགས་པ་དང་། སེམས་ཅན་མཐུན་པའི་འགྲེས་སོ།
en: This passage, furthermore, is in three subsections: the passage on space and beings being alike; the passage on the armor of space-like beings; and the passage on form and so on, and beings, being alike.

source: །དབེན་པ་བཤད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཕན་ཡོན་ཡང་གོ་སླའོ།
en: The explanation of isolation and the benefits of the perfection of wisdom are easy to understand.

source: །བཅོམ་ལྡན་འདས་གང་ཡང་དེ་བཞིན་ཉིད་དུ་གནས་ཤིང་དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བགྱིས་ཏེ། ཆོས་གང་ཡང་མི་དམིགས་ན་དེ་ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གནས་པར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་གནས་པ་དང་།
en: Standing in the knowledge of all aspects Subhūti asks, “Lord, given that no phenomenon is apprehended when they have stood in suchness and practiced for suchness, how will they stand in the knowledge of all aspects?”

source: སྒྲུབ་པ་ཆོས་འགའ་ཞིག་ཡོད་ན་ནི་རིགས་ན། གལ་ཏེ་ཆོས་ཐམས་ཅད་མི་དམིགས་ན་ཇི་ལྟར་གནས་པར་འགྱུར་ཞེས་དྲིས་པའོ།
en: Standing in reality and progress would be viable were any phenomenon to exist, but if all phenomena are not apprehended, how will they stand? “

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ཇི་ལྟ་བ་བཞིན་དུ་གནས་སོ་ཞེས་བྱ་བ་ནི།
en: Subhūti, they stand as things really are, like a tathāgata’s magical creation.”

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་བྱ་བ་ཐམས་ཅད་བྱེད་ཅིང་གནས་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གནས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that just as a tathāgata’s magical creation does all that has to be done and stands, so too bodhisattvas stand as well. “

source: །བཅོམ་ལྡན་འདས་གང་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ཞེས་བགྱི་བའི་ཆོས་གང་ཡང་མི་དམིགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས། འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་མེད་དེ། དེ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་ཉིད་ལ་གནས་པ་དང་། སྒྲུབ་པ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་།
en: Lord, given that no phenomenon called ‘a tathāgata’s magical creation’ is apprehended at all,” and so on, is teaching that there is no phenomenon at all called “a tathāgata’s magical creation,” and because it is just nonexistent there is no standing and practicing in suchness, no full awakening, and no demonstration of the Dharma, so how can it be tenable that “a bodhisattva exists”? “

source: ཆོས་བསྟན་པ་ཡང་མེད་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་ཡོད་དོ་ཞེས་བྱ་བ་ཇི་ལྟར་རིགས་པར་འགྱུར་ཞེས་བསྟན་པའོ། །དེ་བཞིན་ཉིད་ཀྱང་མི་དམིགས་ན།
en: Given that even suchness is not apprehended, what need is there to say more about someone who will stand in suchness.”

source: གང་དེ་བཞིན་ཉིད་ལ་གནས་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཞེས་བྱ་བ་འདིས་ཀྱང་མི་རིགས་པ་གཞན་དག་སྟོན་ཏོ།
en: This teaches other things that are not tenable.

source: །དེ་བཞིན་ཉིད་ཀྱང་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ཀུན་བརྟགས་པ་དང་མཚུངས་པའི་ཕྱིར་དེ་སྐད་བཤད་དོ།
en: It is saying this because during the period it has stains even suchness is comparable to a falsely imagined phenomenon.

source: །དེའི་ཚེ་དེ་བཞིན་ཉིད་ཀྱང་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་དུ་མི་དམིགས་སོ།
en: At that time even suchness cannot be apprehended as what suchness really is.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་རབ་འབྱོར་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ་ཞེས་བཀའ་སྩལ་པའི་དགོངས་པ་ནི་འདི་ཡིན་ཏེ།
en: The Lord’s intention when it says “exactly so, Subhūti, exactly so!”

source: གལ་ཏེ་ཁ་ཅིག་དམིགས་ལ། ཁ་ཅིག་མི་དམིགས་ན་ནི་ཀླན་ཀར་ཡང་འགྱུར་ན།
en: is this: He is saying there would be a fault if something were to be apprehended and something else were not to be apprehended.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་དང་། གནས་པ་དང་། སྒྲུབ་པ་ཐམས་ཅད་མེད་ན་དེ་ལ་ཀླན་ཀར་འགྱུར་བ་ཅི་ཞིག་ཡོད་ཅེས་གསུངས་པའོ།
en: But given that a bodhisattva, the perfection of wisdom, awakening, standing, and progressing all do not exist what fault is there in this? “

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་ཞེས་བྱ་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱ་བ་གནས་པ་ཡིན་པའི་ཕྱིར་དེ་དུས་ཐམས་ཅད་དུ་ཡོད་དེ།
en: Subhūti, it is because whether the tathāgatas arise or whether the tathāgatas do not arise,” unsurpassed, perfect, complete awakening remains, so it is there at all times.

source: དེའི་ཕྱིར་གནས་པ་ཞེས་བྱ་བ་དང་། སྒྲུབ་པ་ཞེས་བྱ་བ་གང་ཡང་མེད་དེ།
en: Therefore, “standing” and “progress” do not exist at all.

source: དེ་བཞིན་ཉིད་ལ་ནི་གནས་པ་དང་། སྒྲུབ་པ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱེད་པ་གང་ཡང་མེད་དོ་ཞེས་སྟོན་ཏོ།
en: This is teaching that standing, progress, and full awakening do not exist at all in suchness.

source: །དེའི་འོག་ཏུ་རབ་འབྱོར་ལ་བསྟོད་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་བསྟོད་པ་དང་། ལྷ་རྣམས་ཀྱིས་མཆོད་པ་དང་། དགེ་སློང་དྲུག་སྟོང་གི་གཏམ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕན་ཡོན་དང་། ཀུན་དགའ་བོ་ལ་ཡོངས་སུ་གཏད་པ་དང་། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དང་།
en: Then there is the praise of Subhūti, the praise of dwelling in the perfection of wisdom, the worship of the gods, the account of the six thousand monks, the benefits of the perfection of wisdom, the entrusting it to Ānanda, the enactment of a magical performance, the training in the perfections, the glorification of the perfection of wisdom, and the account of it being inexhaustible. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པ་དང་། རབ་ཏུ་བསྔགས་པ་དང་། མི་ཟད་པའི་གཏམ་མོ། ཀུན་དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་ཡི་གེ་ཐམས་ཅད་ལ་འཇུག་གོ། །ཡི་གེ་མེད་པ་ཐམས་ཅད་ལ་འཇུག་གོ།
en: Ānanda, this deep perfection of wisdom is the entrance into all letters, and the entrance into all for which there are no letters.

source: །ཀུན་དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་གཟུངས་ཀྱི་སྒོ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་བྱ་བའི་གཟུངས་ཐམས་ཅད་ཀྱི་སྒོ་ཡིན་ཏེ་ཞེས་བྱ་བ་ནི་གང་དག་ཡི་གེར་གཏོགས་པའི་དྲན་པ་དང་། ཤེས་རབ་དང་།
en: Ānanda, this deep perfection of wisdom is the gateway to all the dhāraṇīs—the dhāraṇī gateways in which bodhisattva great beings should train.”

source: ཏིང་ངེ་འཛིན་དེ་དག་ལ་འཇུག་པར་འགྱུར་བ་དང་། གང་དག་གི་ཡི་གེར་མ་གཏོགས་པའི་དྲན་པ་དང་། ཤེས་རབ་དང་། ཏིང་ངེ་འཛིན་དེ་དག་ལ་འཇུག་པར་འགྱུར་བ་དང་།
en: It is the entrance into those recollections, wisdoms, and meditative stabilizations related with speech sounds; it is the entrance into those recollections, wisdoms, and meditative stabilizations related with that for which there are no speech sounds; and it is the gateway to those doctrine dhāraṇīs, meaning dhāraṇīs, forbearance dhāraṇīs, and secret mantra dhāraṇīs. “

source: གང་ཡང་ཆོས་ཀྱི་གཟུངས་དང་། དོན་གྱི་གཟུངས་དང་། བཟོད་པའི་གཟུངས་དང་། སྔགས་ཀྱི་གཟུངས་དེ་དག་གི་སྒོར་གྱུར་པའོ། །རབ་འབྱོར་གཟུགས་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱི་མི་ཟད་པ་ཉིད་ལ་དམིགས་ནས་ཤེས་རབ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Subhūti, because form is inexhaustible they will accomplish the perfection of wisdom,” and so on, means they should generate wisdom having taken the inexhaustibility of dharmas—form and so on—as their objective support. “

source: །རབ་འབྱོར་གཞན་ཡང་གཟུགས་དང་ནམ་མཁའ་ཟད་མི་ཤེས་པས་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་དེ་བཞིན་ཉིད་དང་། ནམ་མཁའ་ལ་དམིགས་ནས་ཡང་དེ་དག་མི་ཟད་པ་ཉིད་དུ་ཤེས་རབ་བསྐྱེད་པར་བྱའོ།
en: Through form and space being inexhaustible, Subhūti”— even while taking the suchness of form and so on, and space, as an objective support, they should generate the wisdom that they are inexhaustible.

source: །དེའི་འོག་ཏུ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པ་བསྒོམས་པའི་ཕན་ཡོན་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རེ་རེ་ལ་སྦྱར་བས་ནི་གོ་སླའོ།
en: Then the benefits of the space-like inexhaustible meditation connecting it with each of the six perfections is easy to understand. “[

source: །ནང་སྟོང་པ་ཉིད་ལ་ནང་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་འདི་ནང་སྟོང་པ་ཉིད་དོ་ཞེས་རྣམ་པར་མི་རྟོག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They] do not apprehend inner emptiness as ‘inner emptiness’ ” means they do not construct it in thought as “inner emptiness.” “[

source: །གཟུགས་སྟོང་ཞེས་བྱ་བའམ། མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་གཉི་གར་ཡང་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་རོ།
en: They] do not apprehend ‘form is empty’ or ‘is not empty,’ ” because they do not construct it in thought as being either.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གཅིག་ལ་གཅིག་སྦྱར་བ་དང་། དེའི་འོག་ཏུ་ཐབས་མཁས་པ་དང་། ཚོགས་ཡོངས་སུ་རྫོགས་པའི་གཏམ་དང་འཁོར་ལོས་སྒྱུར་བའི་དཔེ་དང་། བུད་མེད་ཀྱི་དཔེ་དང་། གཡུལ་ངོར་འགྲོ་བའི་སྐྱེས་བུ་དཔའ་བའི་དཔེ་དང་། ཁམས་ཀྱི་རྒྱལ་པོའི་དཔེ་དང་། ཆུ་ཀླུང་གི་དཔེ་དང་།
en: Each of the six perfections being connected one with the other, then skillful means and the account of the completion of the accumulations, the wheel-turning emperor illustration, the woman illustration, the heroic person who heads into battle illustration, the local ruler illustration, the river illustration, the right hand illustration, the taste in the ocean illustration, the precious wheel illustration, and then the explanation of the six perfections are easy to understand. “

source: ལག་པ་གཡས་པའི་དཔེ་དང་། རྒྱ་མཚོའི་ཆེན་པོའི་རོའི་དཔེ་དང་། འཁོར་ལོ་རིན་པོ་ཆེའི་དཔེ་དང་། དེ་ནས་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བཤད་པ་དག་ནི་གོ་སླའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཐ་དད་པ་མ་མཆིས་ན་ཅིའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔའི་རབ་ཅེས་བགྱི་ཞེས་བྱ་བ་ནི་ཐ་དད་པ་མེད་པའི་ཕྱིར་ཁྱད་པར་མེད་དེ།
en: Lord, if the perfections are not different why is the perfection of wisdom said to be the highest… when it comes to the five perfections?”

source: གཅིག་པ་ལ་རབ་ཅེས་བྱ་བ་མི་རིགས་སོ་ཞེས་དགོངས་པའོ།
en: The idea is that they have no specific feature because they are not different, and a highest is not tenable when they are the same. “

source: །དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་དགོངས་པ་ནི་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་ཐ་དད་པར་མི་འགྱུར་ཏེ། དེ་བས་ན་ཐ་དད་པ་མེད་པ་དེ་ཉིད་ལ་རག་ལུས་པའི་ཕྱིར་དེ་ལ་རབ་ཅེས་བྱ་སྟེ།
en: The idea is that the five perfections are not different when they are informed by it—namely, the perfection of wisdom—so, because based on it they are just not different, it is highest among them.

source: འདིར་ཡང་རི་རབ་ཀྱི་དཔེས་བསྟན་ཏོ།
en: The “Sumeru” illustration teaches this too. “

source: །དོན་གྱི་རྗེས་སུ་ཞུགས་པ་ལ་ནི་ཆོས་གང་ལ་ཡང་བྱེ་བྲག་དང་ཁྱད་པར་མེད་དེ་ཞེས་བྱ་བ་ནི་དོན་གྱི་རྗེས་སུ་ཞུགས་པའི་གང་ཟག་ལ་ཆོས་གང་ཡང་བྱེ་བྲག་ཏུ་མི་སྣང་ངོ་།
en: Lord, given that there is no specific feature or variation in any phenomenon for someone who has entered into reality” is saying that a phenomenon does not appear with a specific feature to a person who has entered into reality.

source: །དེ་བཞིན་དུ་དོན་གྱི་དབང་གིས་ཆོས་རྣམས་ལ་བྱེ་བྲག་གང་ཡང་མེད་དེ།
en: Similarly, because of the force of reality, phenomena have no specific features.

source: དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་མཆོག་ཅེས་བརྗོད་པར་མི་བྱའོ་ཞེས་བྱའོ་ཞེས་གསུངས་པའོ། །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: You should not, therefore, say just the perfection of wisdom is “the most excellent.” “

source: །དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ནི་འདི་སྐད་བསྟན་ཏེ།
en: Exactly so, Subhūti, exactly so!”

source: དོན་གྱི་རྗེས་སུ་ཞུགས་པ་དེ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དབང་གིས་འགྱུར་ཏེ།
en: teaches that based on the perfection of wisdom they become those who have entered into reality, so it is “best.”

source: དེ་བས་ན་དེ་རབ་ཅེས་བྱའོ། །འདི་ལྟར་བྱེ་བྲག་མེད་ཀྱང་འཇིག་རྟེན་ན་བརྡའི་རྗེས་སུ་འབྲང་བས་འདི་ནི་སྦྱིན་པས་སོ། །འདི་ནི་ཚུལ་ཁྲིམས་སོ། །འདི་ནི་བཟོད་པའོ་ཞེས་འདོགས་པར་བྱེད་དེ། འདོགས་པ་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་ལས་འགྱུར་གྱི་གཞན་ལས་ནི་མ་ཡིན་ཏེ།
en: Thus, even though they are not different, following the conventional terms in use in the world, one says “this is on account of giving,” “this is moral,” “this is patience,” and the cause of saying that, furthermore, is the perfection of wisdom, not anything else.

source: འདིར་ཡང་བུད་མེད་རིན་པོ་ཆེའི་དཔེས་བསྟན་ཏོ།
en: The “precious lady” illustration teaches this too. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་གང་ཡང་ཡོངས་སུ་འཛིན་པའམ་གཏོང་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཆོས་འགའ་ཞིག་འཛིན་ན་དེ་ཉིད་མངོན་པར་ཞེན་པའི་སྐྱོན་དུ་འགྱུར་རོ།
en: The perfection of wisdom does not take hold of or release any dharma.”

source: །གལ་ཏེ་གཏོང་ན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་གྲུབ་པར་ནི་འགྱུར་ཏེ། དེ་བས་ན་མི་འཛིན་མི་གཏོང་ངོ་།
en: If a bodhisattva’s wisdom takes hold of any dharma just that is the fault of settling down on it, and even if it releases any, the knowledge of a knower of all aspects is not achieved, hence it “does not take hold of or release.”

source: །ཡང་ན་ཀུན་བརྟགས་པའི་དབང་གིས་ནི་མི་འཛིན། ཆོས་ཉིད་ཀྱི་དབང་གིས་ནི་མི་གཏོང་ངོ་།
en: Alternatively, based on a falsely imagined phenomenon it does not take hold, and based on a true dharmic nature it does not release. “

source: །རབ་འབྱོར་གང་གཟུགས་ཡིད་ལ་མི་བྱེད་པ་འདི་ནི་གཟུགས་ཡོངས་སུ་མི་འཛིན་པའོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་མི་འཛིན་ཞེས་བྱ་བ་གང་ཡང་མེད་ཀྱི།
en: Subhūti, those who do not pay attention to form… do not take hold of form.” There is no “do not take hold” at all.

source: ཡང་དག་པ་མ་ཡིན་པ་ནི་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་ཡིད་ལ་མི་བྱེད་པ་ཉིད་ཡོངས་སུ་མི་འཛིན་པ་ཞེས་བྱའོ།
en: The unreal is something that does not exist, so it says just those who do not pay attention “do not take hold.” “

source: །རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ཡིད་ལ་མི་བྱེད་པ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡིད་ལ་མི་བྱེད་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་རྩ་བ་རྣམས་རྣམ་པར་འཕེལ་བར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་ཡོད་པ་མ་ཡིན་པའི་ཆོས་རྣམས་མེད་པས་དངོས་པོ་མེད་པའི་བདག་ཉིད་དུ་ཡོངས་སུ་ཤེས་ནས་ཡིད་ལ་མི་བྱེད་པ་ཉིད་དགེ་བའི་རྩ་བ་འཕེལ་བ་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: Subhūti, when bodhisattva great beings do not pay attention to form, up to do not pay attention to unsurpassed, perfect, complete awakening, then those bodhisattva great beings’ wholesome roots flourish.” Phenomena that do not exist are nonexistent, so it teaches that having comprehended that they are nonexistent things and just not paying attention to them is the flourishing of wholesome roots. “

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཉམས་པར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནི་མཚན་མར་དམིགས་པའི་ཉེས་པས་ཆགས་པའོ།
en: Those bodhisattva great beings fall back from the perfection of wisdom.” On account of the fault of focusing on the causal sign they have attachment. “

source: །ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་བཟུང་བ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མ་ཆགས་པ་དེ་ཉིད་ཡོངས་སུ་མ་བཟུང་བ་སྟེ།
en: All phenomena… have not been taken hold of.” They have not been taken hold of because they are not attached to the perfection of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ནི་གང་དུ་ཡང་ཆགས་པ་མེད་ལ། གང་ཡང་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: The wisdom of the bodhisattvas is not attached to anything and does not take hold of anything.

source: །འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དུས་ཐམས་ཅད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་དང་མ་བྲལ་བའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Thus, “the perfection of wisdom is not separated from the perfection of wisdom” means that at all times the perfection of wisdom is not separated from the intrinsic nature of the perfection of wisdom.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱང་ཇི་ལྟ་ཇི་ལྟ་བུའི་ངོ་བོ་ཉིད་དང་མ་བྲལ་ལགས་ན། འོ་ན་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་གལ་ཏེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་མ་བྲལ་བ་ཡིན་ན།
en: If all dharmas, whatever they are, are thus not separated from their intrinsic nature, “how, then, is the perfection of wisdom to be accomplished?”

source: འོ་ན་ཇི་ལྟར་དེ་དག་དགེ་བའི་རྩ་བ་ལ་སོགས་པས་ཉེ་བར་གཟུང་བར་བྱ་ཞེས་ཞུས་པའོ།
en: This is asking: if all dharmas are not separated from their intrinsic nature, how then, through the wholesome roots and so on, are they to be appropriated? “[

source: །གཟུགས་ལ་མངོན་པར་ཞེན་པ་མེད་དེ་འདི་ནི་གཟུགས་སོ། །འདི་ནི་གཟུགས་སོ་ཞེས་བྱ་བར་མངོན་པར་ཞེན་པ་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་སྟོན་ཏེ། ཆོས་ནི་ཆོས་མངོན་པར་མི་སྒྲུབ་སྟེ། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་ཕྱིར་རོ།
en: They] do not settle down on form, nor do they settle down on ‘this is form, this is its form,’ ” and so on, is teaching that nothing accomplishes anything, because they do not settle down on anything.

source: །ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་ཇི་ལྟ་ཇི་ལྟ་བུར་གནས་པའི་མཚན་ཉིད་ཀྱི་ཆོས་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་རྟོགས་པ་ཉིད་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱའི་གཞན་དུ་ནི་མ་ཡིན་ནོ།
en: By properly not seeing, just the realization of things as they really are, marked by remaining just as they are, is said to be accomplishing, not something else.

source: །ཞེས་དེ་སྐད་སྟོན་ཏོ། །འཁོར་ལོས་སྒྱུར་བའི་དཔེ་དང་། ཁ་ལོ་སྒྱུར་བའི་དཔེས་ཀྱང་ཤེས་པར་བྱའོ།
en: This should also be understood from the “wheel-turning emperor” analogy and the “driver” analogy. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆོས་གང་སྐྱེད་པ་མ་ལགས་འགོག་པ་མ་ལགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས། འདི་སྐད་ཞུས་ཏེ། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཆོས་གང་ཡང་མི་སྐྱེད་ལ། ནག་པོའི་ཆོས་ཀྱང་མི་འགོག་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གིས་ཅི་ཞིག་བྱ་སྟེ།
en: Lord, if the perfection of wisdom does not produce and does not stop any phenomenon,” and so on, is asking: If the bodhisattvas’ wisdom does not produce any dharma and does not stop anything bad, what do the six perfections do?

source: ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་ཞེས་ཞུས་པའོ།
en: How will the six perfections be completed?

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་གསུངས་ཏེ། ཅི་ཞིག་བསྐྱེད་པར་བྱའོ་སྙམ་མམ།
en: With “Subhūti, having turned the knowledge of all aspects into an objective support,” and so on, the Lord is saying: they do not complete the equipment, having thought ‘I have to produce something.

source: ཅི་ཞིག་དགག་པར་བྱའོ་སྙམ་དུ་བསམས་ཏེ།
en: I have to stop something.’

source: ཚོགས་ཡོངས་སུ་རྫོགས་པར་མི་བྱ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབའ་ཞིག་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་ཡོངས་སུ་རྫོགས་པར་བསྟན་པའོ།
en: It is teaching that they dedicate them over to the knowledge of all aspects and complete them. “

source: །གཟུགས་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ན། གཟུགས་ལ་ཀུན་ཏུ་སྦྱོར་བ་ལས་དབྲལ་བར་བྱའོ། །མི་ལྡན་པ་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བའི་བློ་བསྐྱེད་པར་མི་བྱ་སྟེ།
en: Form is not conjoined and not disjoined.” When they practice the six perfections they should not have it in mind that they have to separate from, and have to produce a disjunction from, the fetters to form.

source: འདི་ལྟར་བདག་ཉིད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means because something with such an essence is in its intrinsic nature pure it “is not conjoined and not disjoined.” “[

source: །གཟུགས་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས། རྣམ་པར་སྨིན་པ་ཡིད་དུ་འོང་བའི་ཕུང་པོ་ལ་སོགས་པ་ལ་གནས་པར་བྱའོ་སྙམ་པའམ།
en: They] should not work with the idea ‘I will stand in form,’ ” and so on.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་འབྲས་བུའི་ཚུལ་དུ་གནས་པར་བྱའོ་སྙམ་དུ་བརྩོན་པར་མི་བྱ་བའོ།
en: They should not work with the idea, “In my future lives I will be someone with a great body and mind,” or “I will stand, in result mode, in the knowledge of all aspects.” “

source: །གཟུགས་ནི་གང་ལ་ཡང་མི་གནས་སོ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་བྱའོ།
en: Form is not situated anywhere.” Take this as the true dharmic nature of form.

source: །བཟའ་ཤིང་གི་དཔེ་དང་། ཐམས་ཅད་ཀྱི་སྒོ་དང་། འཕོང་གི་སློབ་དཔོན་གྱི་དཔེའོ།
en: There is the fruit tree analogy, and “the door of all,” and “the master archer” analogies.

source: །དེའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་དགོངས་པ་ལ་ཅི་ནས་ཀྱང་སྦྱིན་པ་མི་དམིགས་པ་དང་། ཚུལ་ཁྲིམས་དང་བཟོད་པ་མི་དམིགས་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་སྦྱིན་པ་ལ་སོགས་པ་མི་དམིགས་པས་མི་དམིགས་པའི་ཚུལ་དུ་དགོངས་པ་སྟེ།
en: Then, “the buddhas… watch over… but they do not apprehend giving, do not apprehend morality, patience… at all.”

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་དགོངས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Just as they watch by way of not apprehending, by not apprehending giving and so on, so too they watch over bodhisattvas as well, by way of not apprehending them. “

source: །དེ་བཞིན་ཉིད་ཤེས་ན་ཆོས་ཐམས་ཅད་ཀྱི་མདོ་དང་རྒྱས་པ་ཤེས་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་ཡོངས་སུ་གྲུབ་པ་དེ་བཞིན་ཉིད་ཙམ་དུ་ཤེས་པ་དེའི་ཚེ་མདོ་ཤེས་པར་འགྱུར་རོ།
en: When they know the suchness… they will come to know all dharmas in brief and in detail.”

source: །གང་གི་ཚེ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་། ཚོར་བའི་དེ་བཞིན་ཉིད་ལ་སོགས་པ་མ་དག་ཅིང་ཡོངས་སུ་མ་གྲུབ་པར་ཤེས་པ་དེའི་ཚེ་རྒྱས་པ་ཤེས་པར་འགྱུར་རོ།
en: When they know the thoroughly established phenomenon as just “suchness,” they come to know in brief; and when they know the suchness of form, the suchness of feeling, and so on as uncleaned thoroughly unestablished phenomena, they come to know in detail. “

source: །རབ་འབྱོར་མཐའ་མེད་པ་ནི་ཡང་དག་པའི་མཐའ་སྟེ་ཞེས་བྱ་བ་ནི་མཐའ་ཞེས་བྱ་བའི་སྒྲ་ནི་རྩེ་མོའི་དོན་ཏེ།
en: Subhūti, the very limit of reality is the limitless.”

source: དཔེར་ན་རིའི་རྩེ་མོ་ཞེས་བྱ་བ་ལྟ་བུའོ།
en: The word “limit” means summit, as in, for instance, “the summit of a mountain.”

source: །ཁ་ཅིག་ཏུ་ནི་མཐའ་ལ་བྱ་སྟེ་དཔེར་ན་རྒྱ་མཚོའི་མཐའ་ཞེས་བྱ་བ་ལྟ་བུའོ།
en: In some cases it is taken as an end, as in, for instance, “the edge of an ocean.” It is without both of those limits.

source: །མཐའ་དེ་གཉི་ག་ཡང་དེ་ལ་མེད་དེ་དེ་ལ་རྩེ་མོའི་མཐའ་མེད་པ་ནི་མཐའ་གང་ལ་ཆད་པ་ཡང་མ་ཡིན་ཞེས་གསུངས་པའོ། །མཐའ་མེད་པ་ནི་ཡོངས་སུ་ཆད་པ་མེད་ཅེས་གསུངས་པ་སྟེ།
en: Limitless in the sense of summit is saying it is not truncated; endless is saying it is “not delimited.”

source: དེ་བས་ན་ཡང་དག་པའི་མཐའ་ཞེས་བྱ་བ་ནི་དེ་ཁོ་ན་མི་འགྱུར་བ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, it means “the very limit of reality” is “unchangeable reality.” “

source: །རབ་འབྱོར་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་དངོས་པོ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་གཉི་གར་ཡང་མི་འགྱུར་རོ།
en: Subhūti, all dharmas should be known as not conjoined and not disjoined.” They are nonexistent things, so they are neither. “

source: །གཅིག་གི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ལ་མཁས་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་གྲངས་ཤེས་པ་བསྟན་ཏོ། །བུད་མེད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ལ་མཁས་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་རྟགས་ཤེས་པ་བསྟན་ཏོ། །ལམ་གྱི་རྒྱུན་བཅད་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་པའི་ལམ་ལ་མཁས་པའོ། ལམ་གྱི་རྒྱུན་མ་བཅད་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་ལ་མཁས་པའོ།
en: Skilled in singular words” shows they know number; “skilled in feminine words” shows they know gender; “skilled in the path that has been cut” shows they are skilled in the ordinary path; “skilled in the path that has not been cut” shows they are skilled in the extraordinary path. “

source: །རབ་འབྱོར་གཟུགས་ཞི་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཞི་བ་ལ་སོགས་པ་མཚན་ཉིད་བཟུང་སྟེ་ཤེས་རབ་བསྐྱེད་པར་བྱ་བའོ།
en: Subhūti… they should practice the perfection of wisdom through the calmness of form.” Having taken hold of the defining marks of calmness and so on they should generate wisdom. “

source: །རབ་འབྱོར་ནམ་མཁའ་ལྟར་སྟོང་པ་ཉིད་མངོན་པར་བསྒྲུབ་པས།
en: They should accomplish the perfection of wisdom by accomplishing a space-like emptiness.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་བཞིན་དུ་སྟོང་པ་ཉིད་དུ་རྟོགས་པར་བྱ་བའོ།
en: They should comprehend it as a space-like emptiness. “They should meditate on the perfection of wisdom by meditating on a space-like emptiness.”

source: །ནམ་མཁའ་སྟོང་པ་ཉིད་དུ་བསྒོམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་བསྒོམ་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱ་བའོ།
en: They should meditate on emptiness by just meditating on space.
